Journey

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <a:Action s:mustUnderstand="1">Create</a:Action>
        <a:To s:mustUnderstand="1">https://{{et_subdomain}}.soap.marketingcloudapis.com/Service.asmx</a:To>
        <fueloauth xmlns="http://exacttarget.com">{{dne_etAccessToken}}</fueloauth>
  </s:Header>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <Objects xsi:type="DataExtension">
                  <Client>
                    <ID>{{et_mid}}</ID>
                </Client>
            <CustomerKey>Journey Data View</CustomerKey>
            <Name>Journey Data View</Name>
            <Description>Mimics the Journey Data View</Description>
            <IsSendable>false</IsSendable>
            <IsTestable>false</IsTestable>
            <Fields>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>VersionID</CustomerKey>
                    <Name>VersionID</Name>
                    <Label>VersionID</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>JourneyID</CustomerKey>
                    <Name>JourneyID</Name>
                    <Label>JourneyID</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>JourneyName</CustomerKey>
                    <Name>JourneyName</Name>
                    <Label>JourneyName</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>400</MaxLength>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>VersionNumber</CustomerKey>
                    <Name>VersionNumber</Name>
                    <Label>VersionNumber</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>CreatedDate</CustomerKey>
                    <Name>CreatedDate</Name>
                    <Label>CreatedDate</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>LastPublishedDate</CustomerKey>
                    <Name>LastPublishedDate</Name>
                    <Label>LastPublishedDate</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>ModifiedDate</CustomerKey>
                    <Name>ModifiedDate</Name>
                    <Label>ModifiedDate</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="DataExtensionField">
                    <CustomerKey>JourneyStatus</CustomerKey>
                    <Name>JourneyStatus</Name>
                    <Label>JourneyStatus</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
            </Fields>
        </Objects>
    </CreateRequest>
</s:Body>
</s:Envelope>
